In [44]:
import pandas as pd

In [45]:
ex_cty = pd.read_excel('exctyall.xls')
im_cty = pd.read_excel('imctyall.xls')
# ex_st = pd.read_excel('exstall.xls')
# im_st = pd.read_excel('imstall.xls')
ex_cty_17_20 = pd.read_excel('exctyall_17_20.xls')
im_cty_17_20 = pd.read_excel('imctyall_17_20.xls')
# ex_st_17_20 = pd.read_excel('exstall_17_20.xls')
# im_st_17_20 = pd.read_excel('imstall_17_20.xls')
# export_final = pd.read_csv('export.csv')
# import_final = pd.read_csv('import.csv')

In [48]:
ex_cty = ex_cty.iloc[3: , :]
new_header = ex_cty.iloc[0] #grab the first row for the header
ex_cty = ex_cty[1:] #take the data less the header row
ex_cty.columns = new_header #s
ex_cty = ex_cty[(ex_cty['statename'] != 'Unidentified')]

ex_cty.head(1)

3,statename,rank,countryd,val2015,val2016,val2017,val2018,share15,share16,share17,share18,change
4,Alabama,0,World,19322.19,20471.18,21786.3,21349.24,1.2853,1.4108,1.409,1.2829,-2.01

In [49]:
im_cty = im_cty.iloc[3: , :]
new_header = im_cty.iloc[0] #grab the first row for the header
im_cty = im_cty[1:] #take the data less the header row
im_cty.columns = new_header #s
im_cty = im_cty[(im_cty['statename'] != 'Unidentified')]


im_cty.head(1)

3,statename,rank,countryd,val2015,val2016,val2017,val2018,share15,share16,share17,share18,change
4,Alabama,0,World,21900.49,22133.6,23628.66,26220.73,0.9739,1.0118,1.0089,1.0312,10.97

In [50]:
ex_cty_17_20 = ex_cty_17_20.iloc[3: , :]
new_header = ex_cty_17_20.iloc[0] #grab the first row for the header
ex_cty_17_20 = ex_cty_17_20[1:] #take the data less the header row
ex_cty_17_20.columns = new_header #s
ex_cty_17_20 = ex_cty_17_20[(ex_cty_17_20['statename'] != 'Unidentified')]

ex_cty_17_20.head(1)

3,statename,rank,countryd,val2017,val2018,val2019,val2020,share17,share18,share19,share20,change
4,Alabama,0,World,21797.74,21416.99,20799.79,17131.28,1.4089,1.2858,1.2658,1.1966,-17.64

In [51]:
im_cty_17_20 = im_cty_17_20.iloc[3: , :]
new_header = im_cty_17_20.iloc[0] #grab the first row for the header
im_cty_17_20 = im_cty_17_20[1:] #take the data less the header row
im_cty_17_20.columns = new_header #s
im_cty_17_20 = im_cty_17_20[(im_cty_17_20['statename'] != 'Unidentified')]

im_cty_17_20.head(1)

3,statename,rank,countryd,val2017,val2018,val2019,val2020,share17,share18,share19,share20,change
4,Alabama,0,World,23594.53,26184.7,28427.94,25512.04,1.0085,1.0318,1.1382,1.0919,-10.26

In [52]:
temp = pd.merge(left = im_cty, right = im_cty_17_20, how = 'inner', 
                on = ['statename', 'countryd'])

im_temp = temp[['statename', 'rank_x', 'countryd', 'val2015', 'val2016', 'val2017_x',
       'val2018_x', 'share15', 'share16', 'share17_x', 'share18_x', 'change_x',
        'val2019', 'val2020',  'share19', 'share20']]

im_temp.columns = ['statename', 'rank', 'countryd', 'val2015', 'val2016', 'val2017',
       'val2018', 'share15', 'share16', 'share17', 'share18', 'change',
        'val2019', 'val2020',  'share19', 'share20']

im_temp = im_temp[['statename', 'rank', 'countryd', 'val2015', 'val2016', 'val2017',
       'val2018', 'val2019', 'val2020', 'share15',  'share16', 'share17', 'share18', 
                'share19', 'share20','change']]

In [74]:
temp = pd.merge(left = ex_cty, right = ex_cty_17_20, how = 'inner', 
                on = ['statename', 'countryd'])

ex_temp = temp[['statename', 'rank_x', 'countryd', 'val2015', 'val2016', 'val2017_x',
       'val2018_x', 'share15', 'share16', 'share17_x', 'share18_x', 'change_x',
        'val2019', 'val2020',  'share19', 'share20']]

ex_temp.columns = ['statename', 'rank', 'countryd', 'val2015', 'val2016', 'val2017',
       'val2018', 'share15', 'share16', 'share17', 'share18', 'change',
        'val2019', 'val2020',  'share19', 'share20']

ex_temp = ex_temp[['statename', 'rank', 'countryd', 'val2015', 'val2016', 'val2017',
       'val2018', 'val2019', 'val2020', 'share15',  'share16', 'share17', 'share18', 
                'share19', 'share20','change']]

In [75]:
ex_temp.head(1)

,statename,rank,countryd,val2015,val2016,val2017,val2018,val2019,val2020,share15,share16,share17,share18,share19,share20,change
0,Alabama,0,World,19322.19,20471.18,21786.3,21349.24,20799.79,17131.28,1.2853,1.4108,1.409,1.2829,1.2658,1.1966,-2.01

In [76]:
temp.head(1)

3,statename,rank_x,countryd,val2015,val2016,val2017_x,val2018_x,share15,share16,share17_x,...,rank_y,val2017_y,val2018_y,val2019,val2020,share17_y,share18_y,share19,share20,change_y
0,Alabama,0,World,19322.19,20471.18,21786.3,21349.24,1.2853,1.4108,1.409,...,0,21797.74,21416.99,20799.79,17131.28,1.4089,1.2858,1.2658,1.1966,-17.64

In [77]:
ex_temp.to_csv('export_2022.csv')

In [78]:
im_temp.to_csv('import_2022.csv')

In [79]:
pwd

'/Users/ChunyanHao/GitHub/Data_visualization_with_R/original_data'